blog/cbc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-06 Fri 10:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric Easley" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaa79f42">1. Motivating example</a></li>
<li><a href="#orgd5cff6d">2. Introduction</a></li>
<li><a href="#org5ba918c">3. Sources of defects and a solution</a></li>
<li><a href="#org0f090fb">4. A metaphor</a></li>
<li><a href="#org27fe0ad">5. Goals</a></li>
<li><a href="#orgafd7b50">6. Type system vs alternatives</a></li>
<li><a href="#orgbf30a7d">7. Summary</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaa79f42" class="outline-2">
<h2 id="orgaa79f42"><span class="section-number-2">1</span> Motivating example</h2>
<div class="outline-text-2" id="text-1">
<p>
Software defects are endemic to virtually all non-trivial software. Their total cost on an annual basis is measured in the billions. Alas, software is irreducibly complex and we must simply accept this, right? Not quite. The SeL4 microkernel, software operating in a decidedly non-trivial domain, has been formally proven to be free of a large class of defects. While I won't advocate formal proof of standard web apps here, this example does place a very high upper bound on software quality and invite us to consider techniques that can move us in the right direction.
</p>
</div>
</div>

<div id="outline-container-orgd5cff6d" class="outline-2">
<h2 id="orgd5cff6d"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
If we step far enough back, developing software is about creating executable, reusable solutions to problems. A major part of this process is turning an informal or formal set of requirements into running code. That's non-trivial because developing software is a multi-phase process with the opportunity for error in every phase. Research in software psychology affirms the obvious; developing a program consists of three intertwined phases: developing a model of the problem, generating a model of the solution, and encoding the solution as code. We'll focus on the latter two.
</p>
</div>
</div>

<div id="outline-container-org5ba918c" class="outline-2">
<h2 id="org5ba918c"><span class="section-number-2">3</span> Sources of defects and a solution</h2>
<div class="outline-text-2" id="text-3">
<p>
To remedy deficiencies in our model of the solution, it will be useful to have a precise, declarative specification of the solution. This is really a Goldilocks request. Without practice or pressure toward rigor, the heuristics and biases program of psychological research suggests that naive mental models will be convenient rather than correct. We will underestimate the prevalence of or omit rare cases, pattern match our way to subtly incorrect solutions, hand-wave important uncertainties, etc. If naive mental models are too high-level, the code itself is too low-level. Though code enforces rigor and a program unambiguously specifies its own behavior (absent undefined behavior), the detail is overwhelming. Human short-term memory is extremely limited (two to four chunks) so any attempt to use code as our model actually forces the creation of an implicit mental model again through the pruning effect of selective attention. Instead, we want a specification language between these two poles of mentalese and running code. It should be rigorous but still mentally tractable.
</p>

<p>
What does it mean to fail to encode our solution specification? It means that our actual encoding deviates from the specification; it drifts. This immediately suggests that a machine-checkable specification—one where we can automatically and without error ensure correspondence between certain aspects of our specification and code—will be valuable.
</p>

<p>
At last, we reach the point: The contention of this series is that types are well-suited to play this role. They act as a declarative, precise, machine-checkable specification which can improve the process and outcomes of software development. In particular, by making good choices early on in the type system specification, we can save ourselves from harm later (reduce the possibility of defects, make our code more readable, etc.).
</p>
</div>
</div>

<div id="outline-container-org0f090fb" class="outline-2">
<h2 id="org0f090fb"><span class="section-number-2">4</span> A metaphor</h2>
<div class="outline-text-2" id="text-4">
<p>
If it's useful, we can then view types as a commitment mechanism. When we specify our types, we preclude others and future versions of ourselves from taking certain actions&#x2014;actions which we know in the moment to be unwise but which would otherwise remain available and tempting. To make the metaphor more narrative, we can recall a common story used to explain commitment mechanisms: Odysseus and the Sirens. During Odysseus's long voyage home, he needed to pass the island of the Sirens. He had heard their song was so beautiful that all who heard it leapt off their ship in an effort to come closer to the Sirens and hear better. Once they leapt, the Sirens devoured them. Eager to avoid death but still intrigued by this singular music, Odysseus ordered his crewmen to plug their ears with wax while insisting that they instead tie him to the mast and ignore any Siren-induced pleas for release. The plan worked and Odysseus became one of very few mortals to hear the Sirens' music. Like Odysseus, we want to use the type system to restrain ourselves such that we can deliver beautiful functionality while avoiding death by software defect.
</p>
</div>
</div>

<div id="outline-container-org27fe0ad" class="outline-2">
<h2 id="org27fe0ad"><span class="section-number-2">5</span> Goals</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Learn a suite of techniques (primarily leveraging the type system) that can be used to encourage correctness
<ul class="org-ul">
<li>We'll know this goal is met when opportunities for these techniques are repeatedly spotted and used</li>
</ul></li>
<li>Cultivate a sensibility in which defects are ruled out as early as possible.
<ul class="org-ul">
<li>We'll know this goal is well on its way when we can point to one or more instances in which we avoided introducing a defect due to these techniques and lines of thought</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgafd7b50" class="outline-2">
<h2 id="orgafd7b50"><span class="section-number-2">6</span> Type system vs alternatives</h2>
<div class="outline-text-2" id="text-6">
<p>
Earlier, I motivated a need for declarative, precise, machine-checkable specifications. But I didn't (and can't) demonstrate that types are the only tool fulfilling this role. Alternatives that come to mind are tests and other formal methods like model checking. We don't focus on these in this series because:
</p>
<ul class="org-ul">
<li>I cannot possibly hope to resolve the long-running tests vs types discussion here. Instead, I'll make two points in favor of types that I hope are persuasive enough to justify further investment in the series and move on. First, I'll allude to the fairly well-known empirical result in the study of software development that the cost of fixing a defect increases with the lateness of its discovery. Second, I'll contend that types complement and compensate for the human cognitive architecture and deficiencies in a way that tests do not. We plan to explore this relationship in more detail throughout the series. This trick of grounding our claims in cognitive science may allow us to substitute its relatively robust theory and body of evidence for the anemic theory and evidence in the field of software.</li>
<li>The first argument against other formal methods is that they're unfamiliar to most and can thus be hard to introduce in a practicing organization. The second is simply that your humble author is among those less familiar with other formal methods.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf30a7d" class="outline-2">
<h2 id="orgbf30a7d"><span class="section-number-2">7</span> Summary</h2>
<div class="outline-text-2" id="text-7">
<p>
I claimed that precise, declarative, machine-checkable specifications can improve software development. Type systems play that role well. This series should teach the reader techniques that leverage the type system to encourage correctness and cultivate a sensibility of ruling out errors early.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Eric Easley</p>
<p class="date">Created: 2017-10-06 Fri 10:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
